 # Import Libraries

In [1]:
import pandas as pd

import os
working_directory = os.getcwd()
print(working_directory)

/Users/phoebenamyalo/Desktop/Housing Dataset

#  Import Data

This first part of the project is to preparing your data meaning its in the right place or format to conduct your analysis.The first step of the analysis is to import raw data and clean it. Data comes in 3 csv files.

In [2]:
mexico1 = pd.read_csv('mexico-real-estate-1.csv', encoding='ISO-8859-1')
mexico2 = pd.read_csv('mexico-real-estate-2.csv', encoding='ISO-8859-1')
mexico3 = pd.read_csv('mexico-real-estate-3.csv', encoding='ISO-8859-1')

## Clean DataFrames - mexico1

Now that we have three data frames. It is time to inspect them to see if they need any cleaning. I inspect the dataframe by looking at it's shape attributes and use info method to see the data types and the number of missing values. I will start with "mexico1"

In [3]:
# Inspect shape of mexico1 dataframe
mexico1.shape

(700, 7)

In [4]:
# check for missing values and data types
mexico1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            583 non-null    float64
 4   lon            583 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_usd      700 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 38.4+ KB

In [5]:
mexico1.head()

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,2,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,3,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,4,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,5,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

There are a couple of problems with this dataset. It has missing values NaN in the columns Lat & Lon. The column
"price_usd" data type is object (because of "$" & ",") but it should be a float.

In [6]:
# Remove missing values.
mexico1.dropna(inplace=True)

In [7]:
# Transform price column from object to float
mexico1["price_usd"] = (
    mexico1["price_usd"]
    .str.replace("$", "", regex=False)
    .str.replace(",", "")
    .astype(float)
)

# Drop "Unnamed: 0"
mexico1.drop(columns=["Unnamed: 0"], inplace=True)
mexico1.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
5         house           Yucatán  21.052583  -89.538639      205  105191.37

In [8]:
mexico1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.9+ KB

## Clean DataFrames - mexico2

Now will inspect "mexico2" dataframe using the same commands

In [9]:
# Inspect shape of mexico1 dataframe
mexico2.shape

(700, 7)

In [10]:
#check for missing values and data types
mexico2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            571 non-null    float64
 4   lon            571 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_mxn      700 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 38.4+ KB

Looks like there are missing NaN values is columns for Lat & Lon. For the "price_mxn" column, home prices are in 
peso but we want them in usd "price_usd" to match " mexico1"

In [11]:
# Remove missing values.
mexico2.dropna(inplace=True)

In [12]:
# Create a 'price_usd' col
mexico2['price_usd'] = (mexico2['price_mxn']/19).round(2)

# Drop 'price_mxn' col & "Unnamed: 0"
mexico2.drop(columns=["price_mxn", "Unnamed: 0"], inplace=True)
mexico2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581       72   68421.05
2         house           Morelos  23.634501 -102.552788      360  278947.37
6     apartment  Estado de México  19.272040  -99.572013       85   65789.47
7         house   San Luis Potosí  22.138882 -100.996510      158  111578.95
8     apartment  Distrito Federal  19.394558  -99.129707       65   39904.74

## Clean DataFrames - mexico3

In [13]:
# inspect the shape of mexico3 dataframe
mexico3.shape

(700, 6)

In [14]:
# check for missing values and data types
mexico3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               700 non-null    int64
 1   property_type            700 non-null    object
 2   place_with_parent_names  700 non-null    object
 3   lat-lon                  582 non-null    object
 4   area_m2                  700 non-null    int64
 5   price_usd                700 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 32.9+ KB

The lat-lon column has missing rows NaN. The values for this column are also combined with both latitude and longtitude. The "state" column is missing. We need to extract it from "place_with_parent_names" column.

In [15]:
# Drop missing values
mexico3.dropna(inplace=True)

In [16]:
# Split "lat-lon" col
mexico3[["lat", "lon"]] = mexico3["lat-lon"].str.split(",", expand=True)
mexico3.head()

,Unnamed: 0,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,1,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,2,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534
2,3,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69,19.268629,-99.671722
4,5,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67,19.511938,-96.871956
5,6,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00,20.689157,-103.366728

In [17]:
# Create "state" from "place_with_parent_names" col
mexico3["state"] = mexico3["place_with_parent_names"].str.split("|", expand=True)[2]

# Drop cols
mexico3.drop(columns=["place_with_parent_names", "lat-lon", "Unnamed: 0"], inplace=True)

mexico3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,house,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,175,102763.00,20.689157,-103.366728,Jalisco

## Concatenate Dataframes

Combine into a single dataframe to perform further analysis

In [18]:
mexico_df = pd.concat([mexico1, mexico2, mexico3])
print(mexico_df.shape)
mexico_df.head()

(1736, 6)

  property_type             state      lat      lon  area_m2  price_usd
0         house  Estado de México  19.5602 -99.2335      150   67965.56
1         house        Nuevo León  25.6884 -100.199      186   63223.78
2     apartment          Guerrero  16.7677 -99.7644       82   84298.37
3     apartment          Guerrero  16.8298  -99.911      150   94308.80
5         house           Yucatán  21.0526 -89.5386      205  105191.37

## Save Dataframe

Save mexico_df to a CSV file using the to_csv method

In [19]:
mexico_df.to_csv("/Users/phoebenamyalo/Desktop/Housing Dataset/mexico-real-estate-clean.csv", index=False)